{
  "name": "Ranger",
  "source": "Player's Handbook",
  "class description": "<p>Far from bustling cities, amid the trees of trackless forests and across wide plains, Rangers keep their unending watch in the wilderness. Rangers learn to track their quarry as a predator does, moving stealthily through the wilds and hiding themselves in brush and rubble.</p><p>Thanks to their connection with nature, Rangers can also cast spells that harness primal powers of the wilderness. A Ranger's talents and magic are honed with deadly focus to protect the world from the ravages of monsters and tyrants.</p>",
  "core traits": [
    {
      "name": "Primary Ability",
      "html description": "Dexterity and Wisdom"
    },
    {
      "name": "Hit Point Die",
      "html description": "D10 per Ranger level"
    },
    {
      "name": "Saving Throw Proficiencies",
      "html description": "Strength and Dexterity"
    },
    {
      "name": "Skill Proficiencies",
      "html description": "Choose 3: Animal Handling, Athletics, Insight, Investigation, Nature, Perception, Stealth, or Survival"
    },
    {
      "name": "Weapon Proficiencies",
      "html description": "Simple and Martial weapons"
    },
    {
      "name": "Armor Training",
      "html description": "Light and Medium armor and Shields"
    },
    {
      "name": "Starting Equipment",
      "html description": "Choose A or B: (A) Studded Leather Armor, Scimitar, Shortsword, Longbow, 20 Arrows, Quiver, Druidic Focus (sprig of mistletoe), Explorer's Pack and 7 GP; or (B) 150 GP"
    }
  ],
  "subclasses": [
    {
      "name": "Ranger spell list",
      "url": "/content/classes/subclasses/ranger_spell-list"
    },
    {
      "name": "Beast Master",
      "url": "/content/classes/subclasses/ranger_beast-master"
    },
    {
      "name": "Fey Wanderer",
      "url": "/content/classes/subclasses/ranger_fey-wanderer"
    },
    {
      "name": "Gloom Stalker",
      "url": "/content/classes/subclasses/ranger_gloom-stalker"
    },
    {
      "name": "Hunter",
      "url": "/content/classes/subclasses/ranger_hunter"
    },
    {
      "name": "Winter Walker",
      "url": "/content/classes/subclasses/ranger_winter-walker"
    }
  ],
  "multiclass requirements": [],
  "multiclass characteristics": [
    {
      "name": "Gained Traits",
      "html_content": "<ul>\n<li>Gain the following traits from the Core Ranger Traits table: Hit Point Die, proficiency with Martial weapons, proficiency in one skill of your choice from the Ranger's skill list, training with Light and Medium Armor and Shields.</li>\n<li>Gain the Ranger's level 1 features, which are listed in the Ranger Features table. See the multiclassing rules in <a href=\"/class:multiclassing\">multiclassing</a> to determine your available spell slots.</li>\n</ul>"
    }
  ],
  "class feature table": [
    {
      "name": "Class Feature Table",
      "columns": [
        "Level",
        "Favored Enemy",
        "Prepared Spells",
        "1st",
        "2nd",
        "3rd",
        "4th",
        "5th"
      ],
      "rows": [
        [
          "1",
          "2",
          "2",
          "2",
          "-",
          "-",
          "-",
          "-"
        ],
        [
          "2",
          "2",
          "3",
          "2",
          "-",
          "-",
          "-",
          "-"
        ],
        [
          "3",
          "2",
          "4",
          "3",
          "-",
          "-",
          "-",
          "-"
        ],
        [
          "4",
          "2",
          "5",
          "3",
          "-",
          "-",
          "-",
          "-"
        ],
        [
          "5",
          "3",
          "6",
          "4",
          "2",
          "-",
          "-",
          "-"
        ],
        [
          "6",
          "3",
          "6",
          "4",
          "2",
          "-",
          "-",
          "-"
        ],
        [
          "7",
          "3",
          "7",
          "4",
          "3",
          "-",
          "-",
          "-"
        ],
        [
          "8",
          "3",
          "7",
          "4",
          "3",
          "-",
          "-",
          "-"
        ],
        [
          "9",
          "4",
          "9",
          "4",
          "3",
          "2",
          "-",
          "-"
        ],
        [
          "10",
          "4",
          "9",
          "4",
          "3",
          "2",
          "-",
          "-"
        ],
        [
          "11",
          "4",
          "10",
          "4",
          "3",
          "3",
          "-",
          "-"
        ],
        [
          "12",
          "4",
          "10",
          "4",
          "3",
          "3",
          "-",
          "-"
        ],
        [
          "13",
          "5",
          "11",
          "4",
          "3",
          "3",
          "1",
          "-"
        ],
        [
          "14",
          "5",
          "11",
          "4",
          "3",
          "3",
          "1",
          "-"
        ],
        [
          "15",
          "5",
          "12",
          "4",
          "3",
          "3",
          "2",
          "-"
        ],
        [
          "16",
          "5",
          "12",
          "4",
          "3",
          "3",
          "2",
          "-"
        ],
        [
          "17",
          "6",
          "14",
          "4",
          "3",
          "3",
          "3",
          "1"
        ],
        [
          "18",
          "6",
          "14",
          "4",
          "3",
          "3",
          "3",
          "1"
        ],
        [
          "19",
          "6",
          "15",
          "4",
          "3",
          "3",
          "3",
          "2"
        ],
        [
          "20",
          "6",
          "15",
          "4",
          "3",
          "3",
          "3",
          "2"
        ]
      ]
    }
  ],
  "features": [
    {
      "name": "Spellcasting",
      "level": 1,
      "html_content": "<p>You have learned to channel the magical essence of nature to cast spells. See Chapter 7 for the rules on Spellcasting. The Information below details how you use those rules with Ranger spells, which appear in the <a href=\"/ranger:spell-list\">Ranger spell list</a> later in the class's description.</p>\n<p><strong>Spell Slots.</strong> The Ranger Features table shows how many spell slots you have to cast your level 1+ spells. You regain all expended slots when you finish a Long Rest.</p>\n<p><strong>Prepared Spells of Level 1+.</strong> You prepare the list of level 1+ spells that are available for you to cast with this feature. To start, choose two level 1 Ranger spells <a href=\"/spell:cure-wounds\">Cure Wounds</a> and <a href=\"/spell:ensnaring-strike\">Ensnaring Strike</a> are recommended.</p>\n<p>The number of spells on your list increases as you gain Ranger levels, as shown in the Prepared Spells column of the Ranger Features table. Whenever that number increases, choose additional spells from the Ranger spell list until the number of spells on your list matches the number on the table. The chosen spells must be of a level for which you have spell slots. For example, if you're a level 5 Ranger, your list of prepared spells can include six spells of levels 1 and 2 in any combination.</p>\n<p>If another Ranger feature gives you spells that you always have prepared, those spells don’t count against the number of spells you can prepare with this feature, but those spells otherwise count as Ranger spells for you.</p>\n<p><strong>Changing Your Prepared Spells.</strong> Whenever you finish a Long Rest, you can replace one spell on your list with another Ranger spell for which you have spell slots.</p>\n<p><strong>Spellcasting Ability.</strong> Wisdom is your spellcasting ability for your Ranger spells.</p>\n<p><strong>Spellcasting Focus.</strong> You can use a Druidic Focus as a Spellcasting Focus for your Ranger spells.</p>"
    },
    {
      "name": "Favored Enemy",
      "level": 1,
      "html_content": "<p>You always have the <a href=\"/spell:hunter-s-mark\">Hunter's Mark</a> spell prepared.<br>\nYou can cast it twice without expending a spell slot, and you regain all expended uses of this ability when you finish a Long Rest.</p>\n<p>The number of times you can cast the spell without a spell slot increases when you reach certain Ranger Levels, as shown in the Favored Enemy column of the Ranger Features table.</p>"
    },
    {
      "name": "Weapon Mastery",
      "level": 1,
      "html_content": "<p>Your training with weapons allows you to use the mastery properties of two kinds of weapons of your choice with which you have proficiency, such as Longbows and Shortswords.</p>\n<p>Whenever you finish a Long Rest, you can change the kinds of weapons you chose. For Example, you could switch to using the mastery properties of Scimitars and Longswords.</p>"
    },
    {
      "name": "Deft Explorer",
      "level": 2,
      "html_content": "<p>Thanks to your travels, you gain the following benefits.</p>\n<p><strong>Expertise.</strong>: Choose one of your skill proficiencies with which you lack Expertise. You gain Expertise in that skill.</p>\n<p><strong>Languages.</strong>: You know two languages of your choice from the language tables in chapter 2.</p>"
    },
    {
      "name": "Fighting Style",
      "level": 2,
      "html_content": "<p>You gain a <a href=\"/feat:all\">Fighting Style feat</a> of your choice (see chapter 5). Instead of choosing one of those feats, you can choose the option below.</p>\n<p><strong>Druidic Warrior.</strong> You learn two <a href=\"/druid:spell-list\">Druid cantrips</a> of your choice (See the Druid class's section for a list of Druid spells). <a href=\"/spell:guidance\">Guidance</a> and <a href=\"/spell:starry-wisp\">Starry Wisp</a> are recommended. The chosen cantrips count as Ranger spells for you, and Wisdom is your spellcasting ability for them. Whenever you gain a Ranger level, you can replace one of these cantrips with another Druid cantrip.</p>"
    },
    {
      "name": "Ranger Subclass",
      "level": 3,
      "html_content": "<p>You gain a Ranger Subclass of your choice. The Beast Master, Fey Wanderer, Gloom Stalker and Hunter subclasses are detailed after this class's description. A Subclass is a specialization that grants you features at certain Ranger levels. For the rest of your career, you gain each of your subclass’s features that are of your Ranger level or lower.</p>\n<h5 id=\"toc12\"><span>Ranger Subclasses</span></h5>\n<div class=\"list-pages-box\">    \n\n<table class=\"wiki-content-table\">\n<tbody><tr>\n<th>Name</th>\n</tr>\n<tr>\n<td><a href=\"/ranger:beast-master\">Beast Master</a></td>\n</tr>\n<tr>\n<td><a href=\"/ranger:fey-wanderer\">Fey Wanderer</a></td>\n</tr>\n<tr>\n<td><a href=\"/ranger:gloom-stalker\">Gloom Stalker</a></td>\n</tr>\n<tr>\n<td><a href=\"/ranger:hunter\">Hunter</a></td>\n</tr>\n<tr>\n<td><a href=\"/ranger:winter-walker\">Winter Walker</a></td>\n</tr>\n</tbody></table>\n\n    \n    \n    \n    </div>"
    },
    {
      "name": "Ability Score Improvement",
      "level": 4,
      "html_content": "<p>You gain the <a href=\"/feat:ability-score-improvement\">Ability Score Improvement feat</a> or another <a href=\"/feat:all\">feat of your choice</a> for which you qualify. You gain this feature again at Ranger levels 8, 12, and 16.</p>"
    },
    {
      "name": "Extra Attack",
      "level": 5,
      "html_content": "<p>You can attack twice instead of once whenever you take the Attack action on your turn.</p>"
    },
    {
      "name": "Roving",
      "level": 6,
      "html_content": "<p>Your speed increases by 10 feet while you aren't wearing Heavy Armor. You also have a Climb speed and a Swim Speed equal to your Speed.</p>"
    },
    {
      "name": "Expertise",
      "level": 9,
      "html_content": "<p>Choose two of your skill proficiencies with which you lack Expertise. You gain Expertise in those skills.</p>"
    },
    {
      "name": "Level 10: Tireless",
      "level": 10,
      "html_content": "<p>Primal forces now help fuel you on your journeys, granting you the following benefits.</p>\n<p><strong>Temporary Hit Points.</strong> As a Magic Action, you can give yourself a number of Temporary Hit Points equal to 1d8 plus your Wisdom modifier (minimum of 1). You can use this action a number of times equal to your Wisdom modifier (minimum of once), and you regain all expended uses when you finish a Long Rest.</p>\n<p><strong>Decrease Exhaustion.</strong> Whenever you finish a Short Rest, your Exhaustion level, if any, decreases by 1.</p>"
    },
    {
      "name": "Relentless Hunter",
      "level": 13,
      "html_content": "<p>Taking damage can't break your Concentration on <a href=\"/spell:hunter-s-mark\">Hunter's Mark</a>.</p>"
    },
    {
      "name": "Nature's Veil",
      "level": 14,
      "html_content": "<p>You invoke spirits of nature to magically hide yourself. As a Bonus Action you can give yourself the Invisible condition until the end of your next turn.</p>\n<p>You can use this feature a number of times equal to your Wisdom modifier (minimum of once), and you regain all expended uses when you finish a Long Rest.</p>"
    },
    {
      "name": "Precise Hunter",
      "level": 17,
      "html_content": "<p>You have Advantage on attack rolls against the creature currently marked by your <a href=\"/spell:hunter-s-mark\">Hunter's Mark</a>.</p>"
    },
    {
      "name": "Feral Senses",
      "level": 18,
      "html_content": "<p>Your connection to the forces of nature grants you Blindsight with a range of 30 feet.</p>"
    },
    {
      "name": "Epic Boon",
      "level": 19,
      "html_content": "<p>You gain an <a href=\"/feat:all\">Epic Boon feat</a> or another feat of your choice for which you qualify. <a href=\"/feat:boon-of-dimensional-travel\">Boon of Dimensional Travel</a> is recommended.</p>"
    },
    {
      "name": "Level 20: Foe Slayer",
      "level": 20,
      "html_content": "<p>The damage die of your <a href=\"/spell:hunter-s-mark\">Hunter's Mark</a> is a d10 rather than a d6.</p>"
    }
  ]
}