{
  "name": "Barbarian",
  "source": "Player's Handbook",
  "class description": "<p>Barbarians are mighty warriors who are powered by primal forces of the multiverse that manifest as a Rage. More than a mere emotion—and not limited to anger—this Rage is an incarnation of a predator’s ferocity, a storm's fury, and a sea's turmoil.</p><p>Some Barbarians personify their Rage as a fierce spirit or revered forebear. Others see it as a connection to the pain and anguish of the world, as an impersonal tangle of wild magic, or as an expression of their own deepest self. For every Barbarian, their Rage is a power that fuels not just battle prowess, but also uncanny reflexes and heightened senses.</p><p>Barbarians often serve as protectors and leaders in their communities. They charge headlong into danger so those under their protection don't have to. Their courage in the face of danger makes Barbarians perfectly suited for adventure.</p>",
  "core traits": [
    {
      "name": "Primary Ability",
      "html description": "Strength"
    },
    {
      "name": "Hit Point Die",
      "html description": "D12 per Barbarian level"
    },
    {
      "name": "Saving Throw Proficiencies",
      "html description": "Strength and Constitution"
    },
    {
      "name": "Skill Proficiencies",
      "html description": "Choose 2: Animal Handling, Athletics, Intimidation, Nature, Perception, or Survival"
    },
    {
      "name": "Weapon Proficiencies",
      "html description": "Simple and Martial weapons"
    },
    {
      "name": "Armor Training",
      "html description": "Light and Medium armor and Shields"
    },
    {
      "name": "Starting Equipment",
      "html description": "Choose A or B: (A) Greataxe, 4 Handaxes, Explorer’s Pack, and 15 GP; or (B) 75 GP"
    }
  ],
  "subclasses": [
    {
      "name": "Path Of The Berserker",
      "url": "/content/classes/subclasses/barbarian_path-of-the-berserker"
    },
    {
      "name": "Path Of The Wild Heart",
      "url": "/content/classes/subclasses/barbarian_path-of-the-wild-heart"
    },
    {
      "name": "Path Of The World Tree",
      "url": "/content/classes/subclasses/barbarian_path-of-the-world-tree"
    },
    {
      "name": "Path Of The Zealot",
      "url": "/content/classes/subclasses/barbarian_path-of-the-zealot"
    }
  ],
  "multiclass requirements": [],
  "multiclass characteristics": [
    {
      "name": "Gained Traits",
      "html_content": "<ul>\n<li>Gain the following traits from the Core Barbarian Traits table: Hit Point Die, proficiency with Martial weapons, and training with Shields.</li>\n<li>Gain the Barbarian's level 1 features, which are listed in the Barbarian Features table.</li>\n</ul>"
    }
  ],
  "class feature table": [
    {
      "name": "Class Feature Table",
      "columns": [
        "Level",
        "Proficiency Bonus",
        "Features",
        "Rages",
        "Rage Damage",
        "Weapon Mastery"
      ],
      "rows": [
        [
          "1",
          "2",
          "Rage, Unarmored Defense, Weapon Mastery",
          "2",
          "2",
          "2"
        ],
        [
          "2",
          "2",
          "Danger Sense, Reckless Attack",
          "2",
          "2",
          "2"
        ],
        [
          "3",
          "2",
          "Barbarian Subclass, Primal Knowledge",
          "3",
          "2",
          "2"
        ],
        [
          "4",
          "2",
          "Ability Score Improvement",
          "3",
          "2",
          "3"
        ],
        [
          "5",
          "3",
          "Extra Attack, Fast Movement",
          "3",
          "2",
          "3"
        ],
        [
          "6",
          "3",
          "Subclass feature",
          "4",
          "2",
          "3"
        ],
        [
          "7",
          "3",
          "Feral Instinct, Instinctive Pounce",
          "4",
          "2",
          "3"
        ],
        [
          "8",
          "3",
          "Ability Score Improvement",
          "4",
          "2",
          "3"
        ],
        [
          "9",
          "4",
          "Brutal Strike",
          "4",
          "3",
          "3"
        ],
        [
          "10",
          "4",
          "Subclass feature",
          "4",
          "3",
          "4"
        ],
        [
          "11",
          "4",
          "Relentless Rage",
          "4",
          "3",
          "4"
        ],
        [
          "12",
          "4",
          "Ability Score Improvement",
          "5",
          "3",
          "4"
        ],
        [
          "13",
          "5",
          "Improved Brutal Strike",
          "5",
          "3",
          "4"
        ],
        [
          "14",
          "5",
          "Subclass feature",
          "5",
          "3",
          "4"
        ],
        [
          "15",
          "5",
          "Persistent Rage",
          "5",
          "3",
          "4"
        ],
        [
          "16",
          "5",
          "Ability Score Improvement",
          "5",
          "4",
          "4"
        ],
        [
          "17",
          "6",
          "Improved Brutal Strike",
          "6",
          "4",
          "4"
        ],
        [
          "18",
          "6",
          "Indomitable Might",
          "6",
          "4",
          "4"
        ],
        [
          "19",
          "6",
          "Epic Boon",
          "6",
          "4",
          "4"
        ],
        [
          "20",
          "6",
          "Primal Champion",
          "6",
          "4",
          "4"
        ]
      ]
    }
  ],
  "features": [
    {
      "name": "Rage",
      "level": 1,
      "html_content": "<p>You can imbue yourself with a primal power called Rage, a force that grants you extraordinary might and resilience. You can enter it as a Bonus Action if you aren't wearing Heavy armor.</p>\n<p>You can enter your Rage the number of times shown for your Barbarian level in the Rages column of the Barbarian Features table. You regain one expended use when you finish a Short Rest, and you regain all expended uses when you finish a Long Rest.</p>\n<p>While active, your Rage follows the rules below.<br>\n<strong>Damage Resistance.</strong> You have Resistance to Bludgeoning, Piercing, and Slashing damage.</p>\n<p><strong>Rage Damage.</strong> When you make an attack using Strength—with either a weapon or an Unarmed Strike—and deal damage to the target, you gain a bonus to the damage that increases as you gain levels as a Barbarian, as shown in the Rage Damage column of the Barbarian Features table.</p>\n<p><strong>Strength Advantage.</strong> You have Advantage on Strength checks and Strength saving throws.</p>\n<p><strong>No Concentration or Spells.</strong> You can't maintain Concentration, and you can't cast spells.</p>\n<p><strong>Duration.</strong> The Rage lasts until the end of your next turn, and it ends early if you don Heavy armor or have the Incapacitated condition. If your Rage is still active on your next turn, you can extend the Rage for another round by doing one of the following:</p>\n<ul>\n<li>Make an attack roll against an enemy.</li>\n<li>Force an enemy to make a saving throw.</li>\n<li>Take a Bonus Action to extend your Rage.</li>\n</ul>\n<p>Each time the Rage is extended, it lasts until the end of your next turn. You can maintain a Rage for up to 10 minutes.</p>"
    },
    {
      "name": "Unarmored Defense",
      "level": 1,
      "html_content": "<p>While you aren't wearing any armor, your base Armor Class equals 10 plus your Dexterity and Constitution modifiers. You can use a Shield and still gain this benefit.</p>"
    },
    {
      "name": "Weapon Mastery",
      "level": 1,
      "html_content": "<p>Your training with weapons allows you to use the <a href=\"/equipment:weapon#mastery-properties\">mastery properties</a> of two kinds of Simple or Martial Melee weapons of your choice, such as Greataxes and Handaxes. Whenever you finish a Long Rest, you can practice weapon drills and change one of those weapon choices.</p>\n<p>When you reach certain Barbarian levels, you gain the ability to use the mastery properties of more kinds of weapons, as shown in the Weapon Mastery column of the Barbarian Features table.</p>"
    },
    {
      "name": "Danger Sense",
      "level": 2,
      "html_content": "<p>You gain an uncanny sense of when things aren't as they should be, giving you an edge when you dodge perils. You have Advantage on Dexterity saving throws unless you have the Incapacitated condition.</p>"
    },
    {
      "name": "Reckless Attack",
      "level": 2,
      "html_content": "<p>You can throw aside all concern for defense to attack with increased ferocity. When you make your first attack roll on your turn, you can decide to attack recklessly. Doing so gives you Advantage on attack rolls using Strength until the start of your next turn, but attack rolls against you have Advantage during that time.</p>"
    },
    {
      "name": "Barbarian Subclass",
      "level": 3,
      "html_content": "<p>You gain a Barbarian subclass of your choice. The Path of the Berserker, Path of the Wild Heart, Path of the World Tree, and Path of the Zealot subclasses are detailed after this class’s description. A subclass is a specialization that grants you features at certain Barbarian levels. For the rest of your career, you gain each of your subclass’s features that are of<br>\nyour Barbarian level or lower.</p>\n<h5 id=\"toc11\"><span>Barbarian Subclasses</span></h5>\n<div class=\"list-pages-box\">    \n\n<table class=\"wiki-content-table\">\n<tbody><tr>\n<th>Name</th>\n</tr>\n<tr>\n<td><a href=\"/barbarian:path-of-the-berserker\">Path Of The Berserker</a></td>\n</tr>\n<tr>\n<td><a href=\"/barbarian:path-of-the-wild-heart\">Path Of The Wild Heart</a></td>\n</tr>\n<tr>\n<td><a href=\"/barbarian:path-of-the-world-tree\">Path Of The World Tree</a></td>\n</tr>\n<tr>\n<td><a href=\"/barbarian:path-of-the-zealot\">Path Of The Zealot</a></td>\n</tr>\n</tbody></table>\n\n    \n    \n    \n    </div>"
    },
    {
      "name": "Primal Knowledge",
      "level": 3,
      "html_content": "<p>You gain proficiency in another skill of your choice from the skill list available to Barbarians at level 1.</p>\n<p>In addition, while your Rage is active, you can channel primal power when you attempt certain tasks; whenever you make an ability check using one of the following skills, you can make it as a Strength check even if it normally uses a different ability: Acrobatics, Intimidation, Perception, Stealth, or Survival. When you use this ability, your Strength represents primal power coursing through you, honing your agility, bearing, and senses.</p>"
    },
    {
      "name": "Ability Score Improvement",
      "level": 4,
      "html_content": "<p>You gain the <a href=\"/feat:ability-score-improvement\">Ability Score Improvement feat</a> or another <a href=\"/feat:all\">feat of your choice</a> for which you qualify. You gain this feature again at Barbarian levels 8, 12, and 16.</p>"
    },
    {
      "name": "Extra Attack",
      "level": 5,
      "html_content": "<p>You can attack twice instead of once whenever you take the Attack action on your turn.</p>"
    },
    {
      "name": "Fast Movement",
      "level": 5,
      "html_content": "<p>Your speed increases by 10 feet while you aren't wearing Heavy armor.</p>"
    },
    {
      "name": "Feral Instinct",
      "level": 7,
      "html_content": "<p>Your instincts are so honed that you have Advantage on Initiative rolls.</p>"
    },
    {
      "name": "Instinctive Pounce",
      "level": 7,
      "html_content": "<p>As part of the Bonus Action you take to enter your Rage, you can move up to half your Speed.</p>"
    },
    {
      "name": "Brutal Strike",
      "level": 9,
      "html_content": "<p>If you use Reckless Attack, you can forgo any Advantage on one Strength-based attack roll of your choice on your turn. The chosen attack roll mustn't have Disadvantage. If the chosen attack roll hits, the target takes an extra 1d10 damage of the same type dealt by the weapon or Unarmed Strike, and you can cause one Brutal Strike effect of your choice.</p>\n<p>You have the following effect options.</p>\n<p><strong>Forceful Blow.</strong> The target is pushed 15 feet straight away from you. You can then move up to half your Speed straight toward the target without provoking Opportunity Attacks.</p>\n<p><strong>Hamstring Blow.</strong> The target’s Speed is reduced by 15 feet until the start of your next turn. A target can be affected by only one Hamstring Blow at a time— the most recent one.</p>"
    },
    {
      "name": "Relentless Rage",
      "level": 11,
      "html_content": "<p>Your Rage can keep you fighting despite grievous wounds. If you drop to 0 Hit Points while your Rage is active and don't die outright, you can make a DC 10 Constitution saving throw. If you succeed, your Hit Points instead change to a number equal to twice your Barbarian level.</p>\n<p>Each time you use this feature after the first, the DC increases by 5. When you finish a Short or Long Rest, the DC resets to 10.</p>"
    },
    {
      "name": "Improved Brutal Strike",
      "level": 13,
      "html_content": "<p>You have honed new ways to attack furiously. The following effects are now among your Brutal Strike options.</p>\n<p><strong>Staggering Blow.</strong> The target has Disadvantage on the next saving throw it makes, and it can’t make Opportunity Attacks until the start of your next turn.</p>\n<p><strong>Sundering Blow.</strong> Before the start of your next turn, the next attack roll made by another creature against the target gains a +5 bonus to the roll. An attack roll can gain only one Sundering Blow bonus.</p>"
    },
    {
      "name": "Persistent Rage",
      "level": 15,
      "html_content": "<p>When you roll Initiative, you can regain all expended uses of Rage. After you regain uses of Rage in this way, you can’t do so again until you finish a Long Rest.</p>\n<p>In addition, your Rage is so fierce that it now lasts for 10 minutes without you needing to do anything to extend it from round to round. Your Rage ends early if you have the Unconscious condition (not just the Incapacitated condition) or don Heavy armor.</p>"
    },
    {
      "name": "Improved Brutal Strike",
      "level": 17,
      "html_content": "<p>The extra damage of your Brutal Strike increases to 2d10. In addition, you can use two different Brutal Strike effects whenever you use your Brutal Strike feature.</p>"
    },
    {
      "name": "Indomitable Might",
      "level": 18,
      "html_content": "<p>If your total for a Strength check or Strength saving throw is less than your Strength score, you can use that score in place of the total.</p>"
    },
    {
      "name": "Epic Boon",
      "level": 19,
      "html_content": "<p>You gain an <a href=\"/feat:all\">Epic Boon feat</a> or another feat of your choice for which you qualify. <a href=\"/feat:boon-of-irresistible-offense\">Boon of Irresistible Offense</a> is recommended.</p>"
    },
    {
      "name": "Level 20: Primal Champion",
      "level": 20,
      "html_content": "<p>You embody primal power. Your Strength and Constitution scores increase by 4, to a maximum of 25.</p>\n</div>"
    }
  ]
}