{
  "name": "Fighter",
  "source": "DND 5e Wikidot (https://dnd5e.wikidot.com/fighter)",
  "license": "Page states Creative Commons Attribution-ShareAlike 3.0 License",
  "class description": "<p>Fighters share an unparalleled mastery with weapons and armor, and a thorough knowledge of the skills of combat. They are well acquainted with death, both meting it out and staring it defiantly in the face.</p>",
  "core traits": [
    {
      "name": "Hit Point Die",
      "html description": "<p>1d10 per fighter level</p>"
    },
    {
      "name": "Saving Throw Proficiencies",
      "html description": "<p>Strength and Constitution</p>"
    },
    {
      "name": "Skill Proficiencies",
      "html description": "<p>Choose two skills from Acrobatics, Animal Handling, Athletics, History, Insight, Intimidation, Perception, and Survival</p>"
    },
    {
      "name": "Armor Proficiencies",
      "html description": "<p>All armor, shields</p>"
    },
    {
      "name": "Weapon Proficiencies",
      "html description": "<p>Simple weapons, martial weapons</p>"
    },
    {
      "name": "Tool Proficiencies",
      "html description": "<p>None</p>"
    }
  ],
  "multiclass requirements": [],
  "multiclass characteristics": [
    {
      "name": "Multiclassing Requirement",
      "html_content": "<p><em>You must have a Dexterity or Strength score of 13 or higher in order to multiclass in or out of this class.</em></p>"
    }
  ],
  "class feature table": [
    {
      "name": "The Fighter",
      "columns": [
        "Level",
        "Proficiency Bonus",
        "Features"
      ],
      "rows": [
        [
          "1st",
          "+2",
          "Fighting Style, Second Wind"
        ],
        [
          "2nd",
          "+2",
          "Action Surge (x1)"
        ],
        [
          "3rd",
          "+2",
          "Martial Archetype"
        ],
        [
          "4th",
          "+2",
          "Ability Score Improvement, Martial Versatility (Optional)"
        ],
        [
          "5th",
          "+3",
          "Extra Attack (x1)"
        ],
        [
          "6th",
          "+3",
          "Ability Score Improvement, Martial Versatility (Optional)"
        ],
        [
          "7th",
          "+3",
          "Martial Archetype feature"
        ],
        [
          "8th",
          "+3",
          "Ability Score Improvement, Martial Versatility (Optional)"
        ],
        [
          "9th",
          "+4",
          "Indomitable (x1)"
        ],
        [
          "10th",
          "+4",
          "Martial Archetype feature"
        ],
        [
          "11th",
          "+4",
          "Extra Attack (x2)"
        ],
        [
          "12th",
          "+4",
          "Ability Score Improvement, Martial Versatility (Optional)"
        ],
        [
          "13th",
          "+5",
          "Indomitable (x2)"
        ],
        [
          "14th",
          "+5",
          "Ability Score Improvement, Martial Versatility (Optional)"
        ],
        [
          "15th",
          "+5",
          "Martial Archetype feature"
        ],
        [
          "16th",
          "+5",
          "Ability Score Improvement, Martial Versatility (Optional)"
        ],
        [
          "17th",
          "+6",
          "Action Surge (x2), Indomitable (x3)"
        ],
        [
          "18th",
          "+6",
          "Martial Archetype feature"
        ],
        [
          "19th",
          "+6",
          "Ability Score Improvement, Martial Versatility (Optional)"
        ],
        [
          "20th",
          "+6",
          "Extra Attack (x3)"
        ]
      ]
    }
  ],
  "starting equipment": {
    "html description": "<p>You start with the following equipment, in addition to the equipment granted by your background:</p>\n<ul>\n<li>(a) chain mail or (b) leather, longbow, and 20 arrows</li>\n<li>(a) a martial weapon and a shield or (b) two martial weapons</li>\n<li>(a) a light crossbow and 20 bolts or (b) two handaxes</li>\n<li>(a) a dungeoneer's pack or (b) an explorer's pack</li>\n</ul>"
  },
  "subclasses": [
    {
      "name": "Arcane Archer",
      "url": "https://dnd5e.wikidot.com/fighter:arcane-archer"
    },
    {
      "name": "Banneret",
      "url": "https://dnd5e.wikidot.com/fighter:banneret"
    },
    {
      "name": "Battle Master",
      "url": "https://dnd5e.wikidot.com/fighter:battle-master"
    },
    {
      "name": "Cavalier",
      "url": "https://dnd5e.wikidot.com/fighter:cavalier"
    },
    {
      "name": "Champion",
      "url": "https://dnd5e.wikidot.com/fighter:champion"
    },
    {
      "name": "Echo Knight",
      "url": "https://dnd5e.wikidot.com/fighter:echo-knight"
    },
    {
      "name": "Eldritch Knight",
      "url": "https://dnd5e.wikidot.com/fighter:eldritch-knight"
    },
    {
      "name": "Psi Warrior",
      "url": "https://dnd5e.wikidot.com/fighter:psi-warrior"
    },
    {
      "name": "Rune Knight",
      "url": "https://dnd5e.wikidot.com/fighter:rune-knight"
    },
    {
      "name": "Samurai",
      "url": "https://dnd5e.wikidot.com/fighter:samurai"
    },
    {
      "name": "Arcane Archer (2016) (UA)",
      "url": "https://dnd5e.wikidot.com/fighter:arcane-archer-ua"
    },
    {
      "name": "Arcane Archer (2017) (UA)",
      "url": "https://dnd5e.wikidot.com/fighter:arcane-archer-2017-ua"
    },
    {
      "name": "Brute (UA)",
      "url": "https://dnd5e.wikidot.com/fighter:brute-ua"
    },
    {
      "name": "Cavalier (UA)",
      "url": "https://dnd5e.wikidot.com/fighter:cavalier-ua"
    },
    {
      "name": "Knight (UA)",
      "url": "https://dnd5e.wikidot.com/fighter:knight-ua"
    },
    {
      "name": "Monster Hunter (UA)",
      "url": "https://dnd5e.wikidot.com/fighter:monster-hunter-ua"
    },
    {
      "name": "Psi Knight (UA)",
      "url": "https://dnd5e.wikidot.com/fighter:psi-knight-ua"
    },
    {
      "name": "Psychic Warrior (UA)",
      "url": "https://dnd5e.wikidot.com/fighter:psychic-warrior-ua"
    },
    {
      "name": "Rune Knight (UA)",
      "url": "https://dnd5e.wikidot.com/fighter:rune-knight-ua"
    },
    {
      "name": "Samurai (UA)",
      "url": "https://dnd5e.wikidot.com/fighter:samurai-ua"
    },
    {
      "name": "Scout (UA)",
      "url": "https://dnd5e.wikidot.com/fighter:scout-ua"
    },
    {
      "name": "Sharpshooter (UA)",
      "url": "https://dnd5e.wikidot.com/fighter:sharpshooter-ua"
    }
  ],
  "features": [
    {
      "level": 1,
      "name": "Fighting Style",
      "html_content": "<p>You adopt a particular style of fighting as your specialty. Choose one of the following options. You can't take a Fighting Style option more than once, even if you later get to choose again.</p>\n<ul>\n<li><strong>Archery (PHB).</strong> You gain a +2 bonus to attack rolls you make with ranged weapons.</li>\n<li><strong>Blind Fighting (TCE).</strong> You have blindsight with a range of 10 feet. Within that range, you can effectively see anything that isn't behind total cover, even if you're blinded or in darkness. Moreover, you can see an invisible creature within that range, unless the creature successfully hides from you.</li>\n<li><strong>Defense (PHB).</strong> While you are wearing armor, you gain a +1 bonus to AC.</li>\n<li><strong>Dueling (PHB).</strong> When you are wielding a melee weapon in one hand and no other weapons, you gain a +2 bonus to damage rolls with that weapon.</li>\n<li><strong>Great Weapon Fighting (PHB).</strong> When you roll a 1 or 2 on a damage die for an attack you make with a melee weapon that you are wielding with two hands, you can reroll the die and must use the new roll, even if the new roll is a 1 or a 2. The weapon must have the two-handed or versatile property for you to gain this benefit.</li>\n<li><strong>Interception (TCE).</strong> When a creature you can see hits a target, other than you, within 5 feet of you with an attack, you can use your reaction to reduce the damage the target takes by 1d10 + your proficiency bonus (minimum 0). You must be wielding a shield or a simple or martial weapon to use this reaction.</li>\n<li><strong>Protection (PHB).</strong> When a creature you can see attacks a target other than you that is within 5 feet of you, you can use your reaction to impose disadvantage on the attack roll. You must be wielding a shield.</li>\n<li><strong>Superior Technique (TCE).</strong> You learn one maneuver of your choice from among those available to the Battle Master archetype. If a maneuver you use requires a saving throw, the DC equals 8 + your proficiency bonus + your Strength or Dexterity modifier (your choice).\n<ul>\n<li>You gain one superiority die (d6). This die fuels your maneuvers and is expended when used. You regain it when you finish a short or long rest.</li>\n</ul></li>\n<li><strong>Thrown Weapon Fighting (TCE).</strong> You can draw a weapon with the thrown property as part of the attack you make with it.\n<ul>\n<li>When you hit with a ranged attack using a thrown weapon, you gain a +2 bonus to the damage roll.</li>\n</ul></li>\n<li><strong>Two-Weapon Fighting (PHB).</strong> When you engage in two-weapon fighting, you can add your ability modifier to the damage of the second attack.</li>\n<li><strong>Unarmed Fighting (TCE).</strong> Your unarmed strikes deal bludgeoning damage equal to 1d6 + your Strength modifier on a hit; if you aren't wielding weapons or a shield, the d6 becomes a d8.\n<ul>\n<li>At the start of each of your turns, you can deal 1d4 bludgeoning damage to one creature grappled by you.</li>\n</ul></li>\n<li><strong>Close Quarters Shooter (UA).</strong> When making a ranged attack while you are within 5 feet of a hostile creature, you do not have disadvantage. Your ranged attacks ignore half cover and three-quarters cover against targets within 30 feet, and you have a +1 bonus to attack rolls on ranged attacks.</li>\n<li><strong>Mariner (UA).</strong> As long as you are not wearing heavy armor or using a shield, you have a swimming speed and a climbing speed equal to your normal speed, and you gain a +1 bonus to armor class.</li>\n<li><strong>Tunnel Fighter (UA).</strong> As a bonus action, you can enter a defensive stance until the start of your next turn. While in the stance, you can make opportunity attacks without using your reaction, and you can use your reaction to make a melee attack against a creature that moves more than 5 feet while within your reach.</li>\n</ul>"
    },
    {
      "level": 1,
      "name": "Second Wind",
      "html_content": "<p>You have a limited well of stamina that you can draw on to protect yourself from harm. On your turn, you can use a bonus action to regain hit points equal to 1d10 + your fighter level.</p>\n<p>Once you use this feature, you must finish a short or long rest before you can use it again.</p>"
    },
    {
      "level": 2,
      "name": "Action Surge",
      "html_content": "<p>Starting at 2nd level, you can push yourself beyond your normal limits for a moment. On your turn, you can take one additional action.</p>\n<p>Once you use this feature, you must finish a short or long rest before you can use it again. Starting at 17th level, you can use it twice before a rest, but only once on the same turn.</p>"
    },
    {
      "level": 3,
      "name": "Martial Archetype",
      "html_content": "<p>At 3rd level, you choose an archetype that you strive to emulate in your combat styles and techniques. The archetype you choose grants you features at 3rd level and again at 7th, 10th, 15th, and 18th level.</p>"
    },
    {
      "level": 4,
      "name": "Ability Score Improvement",
      "html_content": "<p>When you reach 4th level, and again at 6th, 8th, 12th, 14th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.</p>"
    },
    {
      "level": 4,
      "name": "Martial Versatility (Optional)",
      "html_content": "<p>Whenever you reach a level in this class that grants the Ability Score Improvement feature, you can do one of the following, as you shift the focus of your martial practice:</p>\n<ul>\n<li>Replace a fighting style you know with another fighting style available to fighters.</li>\n<li>If you know any maneuvers from the Battle Master archetype, you can replace one maneuver you know with a different maneuver.</li>\n</ul>"
    },
    {
      "level": 5,
      "name": "Extra Attack",
      "html_content": "<p>Beginning at 5th level, you can attack twice, instead of once, whenever you take the Attack action on your turn.</p>\n<p>The number of attacks increases to three when you reach 11th level in this class and to four when you reach 20th level in this class.</p>"
    },
    {
      "level": 9,
      "name": "Indomitable",
      "html_content": "<p>Beginning at 9th level, you can reroll a saving throw that you fail. If you do so, you must use the new roll, and you can't use this feature again until you finish a long rest.</p>\n<p>You can use this feature twice between long rests starting at 13th level and three times between long rests starting at 17th level.</p>"
    }
  ]
}